# Task 1 Data Quality Assessment

- Standard Data Quality Dimensions
- ---------------------------------------
- corret values (accuracy)
- data fields with values (completeness)
- values free from contradiction (consistency)
- values up to date (currency)
- data items with value meta-data (validity)
- records that are duplicated (uniqueness)

## sheet - Transactions

In [1]:
import pandas as pd
import numpy as np

In [42]:
tran=pd.read_excel('raw.xlsx',sheet_name="Transactions",skiprows=1)

In [43]:
tran.head()

,transaction_id,product_id,customer_id,transaction_date,online_order,order_status,brand,product_line,product_class,product_size,list_price,standard_cost,product_first_sold_date
0,1,2,2950,2017-02-25,0.0,Approved,Solex,Standard,medium,medium,71.49,53.62,41245.0
1,2,3,3120,2017-05-21,1.0,Approved,Trek Bicycles,Standard,medium,large,2091.47,388.92,41701.0
2,3,37,402,2017-10-16,0.0,Approved,OHM Cycles,Standard,low,medium,1793.43,248.82,36361.0
3,4,88,3135,2017-08-31,0.0,Approved,Norco Bicycles,Standard,medium,medium,1198.46,381.10,36145.0
4,5,78,787,2017-10-01,1.0,Approved,Giant Bicycles,Standard,medium,large,1765.30,709.48,42226.0

In [44]:
tran.describe()

,transaction_id,product_id,customer_id,online_order,list_price,standard_cost,product_first_sold_date
count,20000.000000,20000.00000,20000.000000,19640.000000,20000.000000,19803.000000,19803.000000
mean,10000.500000,45.36465,1738.246050,0.500458,1107.829449,556.046951,38199.776549
std,5773.647028,30.75359,1011.951046,0.500013,582.825242,405.955660,2875.201110
min,1.000000,0.00000,1.000000,0.000000,12.010000,7.210000,33259.000000
25%,5000.750000,18.00000,857.750000,0.000000,575.270000,215.140000,35667.000000
50%,10000.500000,44.00000,1736.000000,1.000000,1163.890000,507.580000,38216.000000
75%,15000.250000,72.00000,2613.000000,1.000000,1635.300000,795.100000,40672.000000
max,20000.000000,100.00000,5034.000000,1.000000,2091.470000,1759.850000,42710.000000

In [45]:
tran.transaction_date.describe()

count                   20000
unique                    364
top       2017-02-14 00:00:00
freq                       82
first     2017-01-01 00:00:00
last      2017-12-30 00:00:00
Name: transaction_date, dtype: object

### data type

In [46]:
tran.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20000 entries, 0 to 19999
Data columns (total 13 columns):
transaction_id             20000 non-null int64
product_id                 20000 non-null int64
customer_id                20000 non-null int64
transaction_date           20000 non-null datetime64[ns]
online_order               19640 non-null float64
order_status               20000 non-null object
brand                      19803 non-null object
product_line               19803 non-null object
product_class              19803 non-null object
product_size               19803 non-null object
list_price                 20000 non-null float64
standard_cost              19803 non-null float64
product_first_sold_date    19803 non-null float64
dtypes: datetime64[ns](1), float64(4), int64(3), object(5)
memory usage: 2.0+ MB

### missing value

In [47]:
for var in tran.columns:
    print(var, tran[var].unique()[0:20], '\n')

transaction_id [ 1  2  3  4  5  6  7  8  9 10 11 12 13 14 15 16 17 18 19 20]

product_id [ 2  3 37 88 78 25 22 15 67 12  5 61 35 16 79 33 54 27 82 89]

customer_id [2950 3120  402 3135  787 2339 1542 2459 1305 3262 1986 2783 1243 2717
  247 2961 2426 1842 2268 3002]

transaction_date ['2017-02-25T00:00:00.000000000' '2017-05-21T00:00:00.000000000'
 '2017-10-16T00:00:00.000000000' '2017-08-31T00:00:00.000000000'
 '2017-10-01T00:00:00.000000000' '2017-03-08T00:00:00.000000000'
 '2017-04-21T00:00:00.000000000' '2017-07-15T00:00:00.000000000'
 '2017-08-10T00:00:00.000000000' '2017-08-30T00:00:00.000000000'
 '2017-01-17T00:00:00.000000000' '2017-01-05T00:00:00.000000000'
 '2017-02-26T00:00:00.000000000' '2017-09-10T00:00:00.000000000'
 '2017-06-11T00:00:00.000000000' '2017-10-10T00:00:00.000000000'
 '2017-04-03T00:00:00.000000000' '2017-06-02T00:00:00.000000000'
 '2017-04-06T00:00:00.000000000' '2017-01-28T00:00:00.000000000']

online_order [ 0.  1. nan]

order_status ['Approved' 'Cancelled']

brand ['Solex' 'Trek Bicycles' 'OHM Cycles' 'Norco Bicycles' 'Giant Bicycles'
 'WeareA2B' nan]

product_line ['Standard' 'Road' 'Mountain' 'Touring' nan]

product_class ['medium' 'low' 'high' nan]

product_size ['medium' 'large' 'small' nan]

list_price [  71.49 2091.47 1793.43 1198.46 1765.3  1538.99   60.34 1292.84 1071.23
 1231.15  574.64   71.16 1057.51 1661.92 1555.58 1311.44  499.53 1362.99
 1469.44  360.4 ]

standard_cost [  53.62  388.92  248.82  381.1   709.48  829.65   45.26   13.44  380.74
  161.6   459.71   56.93  154.4  1479.11  818.01 1167.18  388.72   57.74
  596.55  270.3 ]

product_first_sold_date [41245. 41701. 36361. 36145. 42226. 39031. 34165. 39915. 33455. 38216.
 40784. 42172. 34527. 34586. 38193. 37873. 38206. 33888. 37337. 36334.]

In [48]:
tran.isnull().sum()

transaction_id               0
product_id                   0
customer_id                  0
transaction_date             0
online_order               360
order_status                 0
brand                      197
product_line               197
product_class              197
product_size               197
list_price                   0
standard_cost              197
product_first_sold_date    197
dtype: int64

# sheet- CustomerDemographic

In [39]:
demo=pd.read_excel('raw.xlsx',sheet_name="CustomerDemographic",skiprows=1)

In [40]:
demo.head()

,customer_id,first_name,last_name,gender,past_3_years_bike_related_purchases,DOB,job_title,job_industry_category,wealth_segment,deceased_indicator,default,owns_car,tenure
0,1,Laraine,Medendorp,F,93,1953-10-12,Executive Secretary,Health,Mass Customer,N,"""'",Yes,11.0
1,2,Eli,Bockman,Male,81,1980-12-16,Administrative Officer,Financial Services,Mass Customer,N,<script>alert('hi')</script>,Yes,16.0
2,3,Arlin,Dearle,Male,61,1954-01-20,Recruiting Manager,Property,Mass Customer,N,2018-02-01 00:00:00,Yes,15.0
3,4,Talbot,NaN,Male,33,1961-10-03,NaN,IT,Mass Customer,N,() { _; } >_[$($())] { touch /tmp/blns.shellsh...,No,7.0
4,5,Sheila-kathryn,Calton,Female,56,1977-05-13,Senior Editor,NaN,Affluent Customer,N,NIL,Yes,8.0

In [41]:
demo.describe()

       customer_id  past_3_years_bike_related_purchases       tenure
count  4000.000000                          4000.000000  3913.000000
mean   2000.500000                            48.890000    10.657041
std    1154.844867                            28.715005     5.660146
min       1.000000                             0.000000     1.000000
25%    1000.750000                            24.000000     6.000000
50%    2000.500000                            48.000000    11.000000
75%    3000.250000                            73.000000    15.000000
max    4000.000000                            99.000000    22.000000

In [54]:
demo.DOB.describe()

count                    3913
unique                   3448
top       1978-01-30 00:00:00
freq                        7
first     1843-12-21 00:00:00
last      2002-03-11 00:00:00
Name: DOB, dtype: object

In [51]:
demo.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4000 entries, 0 to 3999
Data columns (total 13 columns):
customer_id                            4000 non-null int64
first_name                             4000 non-null object
last_name                              3875 non-null object
gender                                 4000 non-null object
past_3_years_bike_related_purchases    4000 non-null int64
DOB                                    3913 non-null datetime64[ns]
job_title                              3494 non-null object
job_industry_category                  3344 non-null object
wealth_segment                         4000 non-null object
deceased_indicator                     4000 non-null object
default                                3698 non-null object
owns_car                               4000 non-null object
tenure                                 3913 non-null float64
dtypes: datetime64[ns](1), float64(1), int64(2), object(9)
memory usage: 406.4+ KB

In [52]:
for var in demo.columns:
    print(var, demo[var].unique()[0:20], '\n')

customer_id [ 1  2  3  4  5  6  7  8  9 10 11 12 13 14 15 16 17 18 19 20]

first_name ['Laraine' 'Eli' 'Arlin' 'Talbot' 'Sheila-kathryn' 'Curr' 'Fina' 'Rod'
 'Mala' 'Fiorenze' 'Uriah' 'Sawyere' 'Gabriele' 'Rayshell' 'Erroll'
 'Harlin' 'Heath' 'Marjie' 'Sorcha' 'Basile']

last_name ['Medendorp' 'Bockman' 'Dearle' nan 'Calton' 'Duckhouse' 'Merali' 'Inder'
 'Lind' 'Birdall' 'Bisatt' 'Flattman' 'Norcross' 'Kitteman' 'Radage'
 'Parr' 'Faraday' 'Neasham' 'Keyson' 'Firth']

gender ['F' 'Male' 'Female' 'U' 'Femal' 'M']

past_3_years_bike_related_purchases [93 81 61 33 56 35  6 31 97 49 99 58 38 85 91 57 79 76 72 74]

DOB ['1953-10-12T00:00:00.000000000' '1980-12-16T00:00:00.000000000'
 '1954-01-20T00:00:00.000000000' '1961-10-03T00:00:00.000000000'
 '1977-05-13T00:00:00.000000000' '1966-09-16T00:00:00.000000000'
 '1976-02-23T00:00:00.000000000' '1962-03-30T00:00:00.000000000'
 '1973-03-10T00:00:00.000000000' '1988-10-11T00:00:00.000000000'
 '1954-04-30T00:00:00.000000000' '1994-07-21T00:00:00.000000000'
 '1955-02-15T00:00:00.000000000' '1983-03-25T00:00:00.000000000'
 '2000-07-13T00:00:00.000000000' '1977-02-27T00:00:00.000000000'
 '1962-03-19T00:00:00.000000000' '1967-07-06T00:00:00.000000000'
 '2001-04-15T00:00:00.000000000' '1980-08-13T00:00:00.000000000']

job_title ['Executive Secretary' 'Administrative Officer' 'Recruiting Manager' nan
 'Senior Editor' 'Media Manager I' 'Business Systems Development Analyst'
 'Senior Quality Engineer' 'Nuclear Power Engineer' 'Developer I'
 'Account Executive' 'Junior Executive' 'Media Manager IV'
 'Sales Associate' 'Professor' 'Geological Engineer' 'Project Manager'
 'Safety Technician I' 'Research Assistant I' 'Accounting Assistant III']

job_industry_category ['Health' 'Financial Services' 'Property' 'IT' nan 'Retail' 'Argiculture'
 'Manufacturing' 'Telecommunications' 'Entertainment']

wealth_segment ['Mass Customer' 'Affluent Customer' 'High Net Worth']

deceased_indicator ['N' 'Y']

default ['"\'' "<script>alert('hi')</script>" datetime.datetime(2018, 2, 1, 0, 0)
 '() { _; } >_[$($())] { touch /tmp/blns.shellshock2.fail; }' 'NIL'
 'ðµ ð ð ð' 'â°â´âµâââ' '(â¯Â°â¡Â°ï¼â¯ï¸µ â»ââ»)' '0/0' 'ð©ð½'
 'ÅâÂ´Â®â\xa0Â¥Â¨ËÃ¸Ïââ' 'nil' -100 'â°â´âµ' 'ð'
 1000000000000000049861653971908893017010268485438462151574892930611988399099305815384459015356416
 'ï¾ï½¥â¿ã¾â²(ï½¡ââ¿âï½¡)â±â¿ï½¥ï¾' 'Î©âÃ§ââ«ËÂµâ¤â¥Ã·' 'ÅâÂ´â°ËÃÂ¨ËÃâââ'
 'ï¼ï¼ï¼']

owns_car ['Yes' 'No']

tenure [11. 16. 15.  7.  8. 13. 20.  9.  6.  1. 18. 21. 12. 19. 14.  4. 22.  5.
 17.  2.]

In [53]:
demo.isnull().sum()

customer_id                              0
first_name                               0
last_name                              125
gender                                   0
past_3_years_bike_related_purchases      0
DOB                                     87
job_title                              506
job_industry_category                  656
wealth_segment                           0
deceased_indicator                       0
default                                302
owns_car                                 0
tenure                                  87
dtype: int64

# sheet - CustomerAddress

In [56]:
addr=pd.read_excel('raw.xlsx',sheet_name="CustomerAddress",skiprows=1)

In [57]:
addr.head()

,customer_id,address,postcode,state,country,property_valuation
0,1,060 Morning Avenue,2016,New South Wales,Australia,10
1,2,6 Meadow Vale Court,2153,New South Wales,Australia,10
2,4,0 Holy Cross Court,4211,QLD,Australia,9
3,5,17979 Del Mar Point,2448,New South Wales,Australia,4
4,6,9 Oakridge Court,3216,VIC,Australia,9

In [58]:
addr.describe()

       customer_id     postcode  property_valuation
count  3999.000000  3999.000000         3999.000000
mean   2003.987997  2985.755939            7.514379
std    1154.576912   844.878364            2.824663
min       1.000000  2000.000000            1.000000
25%    1004.500000  2200.000000            6.000000
50%    2004.000000  2768.000000            8.000000
75%    3003.500000  3750.000000           10.000000
max    4003.000000  4883.000000           12.000000

In [59]:
addr.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3999 entries, 0 to 3998
Data columns (total 6 columns):
customer_id           3999 non-null int64
address               3999 non-null object
postcode              3999 non-null int64
state                 3999 non-null object
country               3999 non-null object
property_valuation    3999 non-null int64
dtypes: int64(3), object(3)
memory usage: 187.6+ KB

In [60]:
for var in addr.columns:
    print(var, addr[var].unique()[0:20], '\n')

customer_id [ 1  2  4  5  6  7  8  9 11 12 13 14 15 16 17 18 19 20 21 24]

address ['060 Morning Avenue' '6 Meadow Vale Court' '0 Holy Cross Court'
 '17979 Del Mar Point' '9 Oakridge Court' '4 Delaware Trail'
 '49 Londonderry Lane' '97736 7th Trail' '93405 Ludington Park'
 '44339 Golden Leaf Alley' '2 Sutherland Street' '9 Mcbride Trail'
 '9861 New Castle Avenue' '52 Moland Street' '82391 Kensington Lane'
 '092 2nd Alley' '59 Spaight Circle' '032 Bartelt Crossing'
 '18 Jenna Center' '3 Cordelia Plaza']

postcode [2016 2153 4211 2448 3216 2210 2650 2023 3044 4557 3799 2760 2428 3331
 3058 2135 2233 2444 4413 4740]

state ['New South Wales' 'QLD' 'VIC' 'NSW' 'Victoria']

country ['Australia']

property_valuation [10  9  4 12  8  6  7  3  5 11  1  2]

In [63]:
addr.isnull().sum()

customer_id           0
address               0
postcode              0
state                 0
country               0
property_valuation    0
dtype: int64

# concludes

##1
- Additional customer_ids in the ‘Transactions table’ and ‘Customer Address table’ but not in ‘Customer Master (Customer Demographic)’
- Mitigation: Please ensure that all tables are from the same period. Only customers in the Customer Master list will be used as a training set for our model. 
- This indicates that the data received may not be in sync with each other which may skew the analysis results if there are missing data records. Please refer to excel file ‘data_outliers.xlsx’ for the list of outliers between tables.

##2
- Various columns, such as the brand of a purchase, or job title, have empty values in certain records
- Mitigation: If only a small number of rows are empty, filter out the record entirely from the training set for prediction. Else, if it is a core field, impute based on distribution in the training dataset. 
- For key datasets, such as transactions, less than 1% of transactions (totalling less than 0.1% of revenue) have missing fields. These records have been removed from the training dataset.

##3
- Inconsistent values for the same attribute (e.g. Victoria being represented as “V”, “Vic” and “Victoria”)
- Mitigation: Use regular expression to replaced extended values into abbreviations to ensure consistency across addresses.
- Recommendation: Enforce a drop-down list for the user entering the data rather than a free text field.
- In order to construct meaningful variables for the model, the data has been cleaned to avoid multiple representations of the same value. Additionally, gender records where ‘U’ have been replaced based on the distribution from the training dataset.

##4
- Inconsistent data type for the sameattribute (e.g. numeric values for some fields and strings for others)
- Mitigation: Convert selected records in characters to numeric. Remove non-numeric characters from string. 
- Recommendation: Ensure that fact tables in the given database have constraints on data types.
- Having different data types for a given field make it difficult to interpret results at the later stage. Therefore, appropriate data transformations are made to ensure consistent data types for a given field.